# Магазин за цветя предлага 3 вида цветя: хризантеми, рози и лалета. Цените зависят от сезона.
# Сезон	            Хризантеми	    Рози	        Лалета
# Пролет / Лято	    2.00 лв./бр.	4.10 лв./бр.	2.50 лв./бр.
# Есен / Зима	    3.75 лв./бр.	4.50 лв./бр.	4.15 лв./бр.
# В празнични дни цените на всички цветя се увеличават с 15%. Предлагат се следните отстъпки:
# •	За закупени повече от 7 лалета през пролетта – 5% от цената на целият букет.
# •	За закупени 10 или повече рози през зимата – 10% от цената на целият букет.
# •	За закупени повече от 20 цветя общо през всички сезони – 20% от цената на целият букет.
# Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
# Цената за аранжиране на букета винаги е 2лв. Напишете програма, която изчислява цената за един букет.
# Вход
# Входът се чете от конзолата и съдържа точно 5 реда:
# •	На първия ред е броят на закупените хризантеми – цяло число в интервала [0 ... 200]
# •	На втория ред е броят на закупените рози – цяло число в интервала [0 ... 200]
# •	На третия ред е броят на закупените лалета – цяло число в интервала [0 ... 200]
# •	На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
# •	На петия ред е посочено дали денят е празник – [Y – да / N - не]
# Изход
# Да се отпечата на конзолата 1 число – цената на цветята, форматирана до вторият знак след десетичната запетая.

chrysanthemums = int(input())
roses = int(input())
tulips = int(input())
season = input()
day = input()

chrysanthemums_price = 0
roses_price = 0
tulips_price = 0
decor = 2
discount = 0
bill = 0

if (season == 'Spring' or season == 'Summer'):
    chrysanthemums_price = 2
    roses_price = 4.1
    tulips_price = 2.5

elif (season == 'Autumn' or season == 'Winter'):
    chrysanthemums_price = 3.75
    roses_price = 4.5
    tulips_price = 4.15

bill = chrysanthemums_price * chrysanthemums + roses_price * roses + tulips_price * tulips

if day == 'Y':
    bill *= 1.15

if tulips > 7 and season == 'Spring':
    bill *= 0.95

if roses >= 10 and season == 'Winter':
    bill *= 0.9

if chrysanthemums + roses + tulips > 20:
    bill *= 0.8

bill += decor

print(f'{bill:.2f}')
