# . Един сезон е 4 месеца. Според зависи сезона и броя километри на месец ще му се заплаща различна сума на километър:
#
# 	                            Пролет/Есен	    Лято	        Зима
#         км на месец <= 5000	0.75 лв./км	    0.90 лв./км	    1.05 лв./км
# 5000 < км на месец <= 10000	0.95 лв./км	    1.10 лв./км 	1.25 лв./км
# 10000 < км на месец <= 20000	1.45 лв./км – за който и да е сезон
#
# След като са извадени 10% за данъци се отпечатват останалите пари.
# Вход
# Входът се чете от конзолата и се състои от два реда:
# •	Първи ред – Сезон – текст "Spring", "Summer", "Autumn" или "Winter"
# •	Втори ред –  Километри на месец – реално число в интервала [10.00...20000.00]
# Изход
# На конзолата трябва да се отпечатат едно число:
# •	Заплатата на шофьора след данъците, форматирана до втория знак след десетичната запетая.

season = input()
distance = float(input())

pay = 0
salary = 0

if distance <= 5000:
    if season == 'Spring' or season == 'Autumn':
        pay = 0.75
    elif season =='Summer':
        pay = 0.90
    elif season == 'Winter':
        pay = 1.05

if distance > 5000 and distance <= 10000:
    if season == 'Spring' or season == 'Autumn':
        pay = 0.95
    elif season =='Summer':
        pay = 1.1
    elif season == 'Winter':
        pay = 1.25

if distance > 10000:
    pay = 1.45

salary = pay * distance * 4

print(f'{(salary * 0.9):.2f}')
