# Напишете програма, която пресмята колко общо пари има в сметката, след като направите определен брой вноски.
# На всеки ред ще получавате сумата, която трябва да внесете в сметката, до получаване на команда  "NoMoreMoney ".
# При всяка получена сума на конзолата трябва да се извежда "Increase: " + сумата и тя да се прибавя в сметката.
# Ако получите число по-малко от 0 на конзолата трябва да се изведе "Invalid operation!"  и програмата да приключи.
# Когато програмата приключи трябва да се принтира "Total: " + общата сума в сметката форматирана до втория знак след десетичната запетая.

acc_sum = 0.0
curr_sum = ''

while 1:
    curr_sum = input()

    if curr_sum == 'NoMoreMoney':
        break

    curr_sum = float(curr_sum)

    if curr_sum < 0.0:
        print(f'Invalid operation!')
        break

    acc_sum += curr_sum
    print(f'Increase: {curr_sum:.2f}')

print(f'Total: {acc_sum:.2f}')
