# 	W - ако е победител получава 2000 точки
# 	F - ако е финалист получава 1200 точки
# 	SF - ако е полуфиналист получава 720 точки
# Напишете програма, която изчислява колко ще са точките на Григор след изиграване на всички турнири, като знаете с колко точки стартира сезона. Също изчислете колко точки средно печели от всички изиграни турнири и колко процента от турнирите е спечелил.
# Вход
# От конзолата първо се четат два реда:
# •	Брой турнири, в които е участвал – цяло число в интервала [1…20]
# •	Начален брой точки в ранглистата - цяло число в интервала [1...4000]
# За всеки турнир се прочита отделен ред:
# •	Достигнат етап от турнира – текст – "W", "F" или "SF"
# Изход
# Отпечатват се три реда в следния формат:
# •	"Final points: {брой точки след изиграните турнири}"
# •	"Average points: {средно колко точки печели за турнир}"
# •	"{процент спечелени турнири}%"
# Средните точки да бъдат закръглени към най-близкото цяло число надолу, а процентът да се форматира до втората цифра след десетичния знак.
import math

tournaments = int(input())
start_points = int(input())

points = 0
wins = 0

for tour in range(tournaments):
    stage = input()

    if stage == 'W':
        points += 2000
        wins += 1
    elif stage == 'F':
        points += 1200
    elif stage == 'SF':
        points += 720

        tour += 1

av_points = points / tournaments
points += start_points

print(f'Final points: {points}')
print(f'Average points: {math.floor(av_points)}')
print(f'{(wins / tournaments * 100):.2f}%')
