# Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент p1 са под 200, друг процент p2 са от 200 до 399,
# друг процент p3 са от 400 до 599, друг процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре.
# Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
# Вход
# На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа. На следващите n реда стои по едно цяло число в интервала [1…1000] –
# числата върху които да бъде изчислена хистограмата.
# Изход
# Да се отпечата на конзолата хистограмата – 5 реда, всеки от които съдържа число между 0% и 100%,
# с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.

num_count = int(input())
p1 = 0
p2 = 0
p3 = 0
p4 = 0
p5 = 0

for i in range(num_count):
    curr_num = int(input())

    if curr_num < 200:
        p1 += 1

    elif 200 <= curr_num < 400:
        p2 += 1

    elif 400 <= curr_num < 600:
        p3 += 1

    elif 600 <= curr_num < 800:
        p4 += 1

    elif curr_num >= 800:
        p5 += 1

p1 = p1 / num_count * 100
p2 = p2 / num_count * 100
p3 = p3 / num_count * 100
p4 = p4 / num_count * 100
p5 = p5 / num_count * 100

print(f'{p1:.2f}% \n {p2:.2f}% \n {p3:.2f}% \n {p4:.2f}% \n {p5:.2f}% \n')


