# Лили вече е на N години. За всеки свой рожден ден тя получава подарък.
# •	За нечетните рождени дни (1, 3, 5...n) получава играчки.
# •	За четните рождени дни (2, 4, 6...n) получава пари.
# За втория рожден ден получава 10.00 лв, като сумата се увеличава с 10.00 лв., за всеки следващ четен рожден ден.
# През годините Лили тайно е спестявала парите. Братът на Лили, в годините, които тя получава пари, взима по 1.00 лев от тях.
# Лили продала играчките получени през годините, всяка за P лева и добавила сумата към спестените пари.
# С парите искала да си купи пералня за X лева. Напишете програма, която да пресмята, колко пари е събрала и дали ѝ стигат да си купи пералня.
# Вход
# Програмата прочита 3 числа, въведени от потребителя, на отделни редове:
# •	Възрастта на Лили - цяло число в интервала [1...77]
# •	Цената на пералнята - число в интервала [1.00...10 000.00]
# •	Единична цена на играчка - цяло число в интервала [0...40]
# Изход
# Да се отпечата на конзолата един ред:
# •	Ако парите на Лили са достатъчни:
# o	"Yes! {N}" - където N е остатъка пари след покупката
# •	Ако парите не са достатъчни:
# o	"No! {М}" - където M е сумата, която не достига
# Числата N и M трябва да за форматирани до вторият знак след десетичната запетая.
import math

age = int(input())
machine_price = float(input())
price_for_one_toy = int(input())

bonus = 0
money = 0
toy_count = 0
all_sum = 0

for cycles in range(1, age + 1):
    if cycles % 2 == 0:
        bonus += 10
        money += bonus
        money -= 1
    else:
        toy_count += 1

all_sum = money + toy_count * price_for_one_toy

if all_sum >= machine_price:
    print(f'Yes! {(math.fabs(all_sum - machine_price)):.2f}')
else:
    print(f'No! {(math.fabs(all_sum - machine_price)):.2f}')

