# Цените на горивата са както следва:
# •	Бензин – 2.22 лева за един литър,
# •	Дизел – 2.33 лева за един литър
# •	Газ – 0.93 лева за литър
# Ако водача има карта за отстъпки,  той се възползва от следните намаления за литър гориво: 18 ст. за литър бензин, 12 ст. за литър дизел и 8 ст. за литър газ.
# Ако шофьора е заредил между 20 и 25 литра включително, той получава 8 процента отстъпка от крайната цена, при повече от 25 литра гориво,
# той получава 10 процента отстъпка от крайната цена.
# Вход
# Входът се чете от конзолата и се състои от 3 реда:
# •	Типа на горивото – текст с възможности: "Gas", "Gasoline" или "Diesel"
# •	Количество гориво – реално число в интервала [1.00 … 50.00]
# •	Притежание на клубна карта – текст с възможности: "Yes" или "No"
# Изход
# На конзолата трябва да се отпечата един ред.
# •	"{крайната цена на горивото} lv."
# Цената на горивото да бъде форматираната до втората цифра след десетичния знак.

type_fuel = input()
fuel_l = float(input())
clubcard = input()

gasoline_price = 2.22
diesel_price = 2.33
gas_prise = 0.93
bill = 0

if type_fuel == 'Diesel' or type_fuel == 'Gasoline' or type_fuel == 'Gas':
    if clubcard == 'Yes':
        gasoline_price -= 0.18
        diesel_price -= 0.12
        gas_prise -= 0.08

    if type_fuel == 'Diesel':
        bill = diesel_price * fuel_l
    if type_fuel == 'Gasoline':
        bill = gasoline_price * fuel_l
    if type_fuel == 'Gas':
        bill = gas_prise * fuel_l

    if  20 < fuel_l <= 25:
        bill *= 0.92
    elif fuel_l > 25:
        bill *= 0.9

    comment = f'{bill:.2f} lv.'

else:
    comment = f'Invalid fuel!'

print(f'{comment}')
