# Напишете програма, която да пресмята резултата от игра. Първо получавате число, което показва колко хода ще продължи играта.
# После за всеки ход на играта ще получавате по едно ново число. Според интервала в който попада числото се прибавят точки.
# Ако числото е отрицателно или по-голямо 50, тогава то е невалидно. В началото на играта резултата е 0 и на всеки ход се прибавят точки по следният начин:
# •	От 0 до 9  20 % от числото
# •	От 10 до 19  30 % от числото
# •	От 20 до 29  40 % от числото
# •	От 30 до 39  50 точки
# •	От 40 до 50  100 точки
# •	Невалидно число  резултата се дели на 2
#
# Освен резултата програмата трябва да изкарва статистика за проценти числа в дадените интервали.
# Вход
# Входът се чете от конзолата:
# •	Първи ред - колко хода ще има по време на играта – цяло число в интервала [1...100]
# •	За всеки ход – числата, които се проверяват в кой интервал са – цели числа в интервала [-100...100]
# Изход
# Да се отпечата на конзолата 7 реда:
# •	1ви ред: "{Краен резултат}"
# •	2ри ред: "From 0 to 9: {процент в интервала}%"
# •	3ти ред: "From 10 to 19: {процент в интервала}%"
# •	4ти ред: "From 20 to 29: {процент в интервала}%"
# •	5ти ред: "From 30 to 39: {процент в интервала}%"
# •	6ти ред: "From 40 to 50: {процент в интервала}%"
# •	7ми ред: "Invalid numbers: {процент в интервала}%"
# Всички числа трябва да са форматирана до вторият знак след запетаята.

tour = int(input())


p_09 = 0
p_1019 = 0
p_2029 = 0
p_3039 = 0
p_4049 = 0
pinv = 0
total_result = 0

for loop in range(tour):
    result = int(input())

    if 0 <= result <= 9:
        p_09 += 1
        total_result += 0.2 * result

    elif 10 <= result <= 19:
        p_1019 += 1
        total_result += 0.3 * result

    elif 20 <= result <= 29:
        p_2029 += 1
        total_result += 0.4 * result

    elif 30 <= result <= 39:
        p_3039 += 1
        total_result += 50

    elif 40 <= result <= 50:
        p_4049 += 1
        total_result += 100

    elif result < 0 or result > 50:
        pinv += 1
        total_result /= 2

    loop += 1

print(f'{total_result:.2f}')
print(f'From 0 to 9: {(p_09 / tour * 100):.2f}%')
print(f'From 10 to 19: {(p_1019 / tour * 100):.2f}%')
print(f'From 20 to 29: {(p_2029 / tour * 100):.2f}%')
print(f'From 30 to 39: {(p_3039 / tour * 100):.2f}%')
print(f'From 40 to 50: {(p_4049 / tour * 100):.2f}%')
print(f'Invalid numbers: {(pinv / tour * 100):.2f}%')
