# Напишете програма, която да пресмята приходите от реколтата в евро ( ако приемем, че едно евро е равно на 1.94лв).
# Вход
# От конзолата се четат 4 числа, по едно на ред:
# •	Първи ред – Цена за килограм зеленчуци – реално число[0.00… 1000.00]
# •	Втори ред – Цена за килограм плодове – реално число[0.00… 1000.00]
# •	Трети ред – Общо килограми на зеленчуците – цяло число[0… 1000]
# •	Четвърти ред – Общо килограми на плодовете – цяло число[0… 1000]
#
# Да се отпечата на конзолата едно число: приходите от всички плодове и зеленчуци в евро.
# Резултата да се форматира до втория знак след десетичния разделител.

price_fruits = float(input())
price_vegetables = float(input())
vol_fruits = int(input())
vol_vegetables = int(input())

euro_bgn = 1 / 1.94

sum_bgn = price_vegetables * vol_vegetables + price_fruits * vol_fruits
sum_euro = sum_bgn * euro_bgn

print(f'{sum_euro: .2f}')
