# Oт конзолата се въвеждат цените в лева на скумрията и цацата. Също количеството на паламуд, сафрид и миди в килограми.
# Колко пари ще са му необходими, за да плати сметката си, ако цените на борсата са:
# •	Паламуд – 60% по-скъп от скумрията
# •	Сафрид – 80% по-скъп от цацата
# •	Миди – 7.50 лв. за килограм
# Вход
# От конзолата се четат 5 числа:
# •	Първи ред – цена на скумрията на килограм. Реално число в интервала [0.00…40.00]
# •	Втори ред – цена на цацата на килограм. Реално число в интервала [0.00…30.00]
# •	Трети ред – килограма паламуд. Реално число в интервала [0.00…50.00]
# •	Четвърти ред – килограма сафрид. Реално число в интервала [0.00… 70.00]
# •	Пети ред – килограма миди. Цяло число в интервала [0 ... 100]
# Изход
# Да се отпечата на конзолата едно число с плаваща запетая: колко пари ще са нужни на Георги,да е форматирано до вторият знак след десетичната запетая (1.2457 -> 1.25).


mackerel_price = float(input())
sprinkle_price = float(input())
bonito_count = float(input())
safrid_count = float(input())
mussels_count = int(input())

bonito_price = mackerel_price * 1.6
safrid_price = sprinkle_price * 1.8
mussels_price = 7.5

bill = (bonito_price * bonito_count + safrid_price * safrid_count + mussels_price * mussels_count)

print(f'{bill:.2f}')