# За даден период от време, всеки ден в болницата пристигат пациенти за преглед.
# Тя разполага първоначално със 7 лекари. Всеки лекар може да преглежда само по един пациент на ден,
# но понякога има недостиг на лекари, затова останалите пациенти се изпращат в други болници.
# Всеки трети ден, болницата прави изчисления и ако броят на непрегледаните пациенти е по-голям от броя на прегледаните,
# се назначава още един лекар. Като назначаването става преди да започне приемът на пациенти за деня.
# Напишете програма, която изчислява за дадения период броя на прегледаните и непрегледаните пациенти.
# Вход
# Входът се чете от конзолата и съдържа:
# •	На първия ред – периода, за който трябва да направите изчисления. Цяло число в интервала [1 ... 1000]
# •	На следващите редове(равни на броят на дните) – броя пациенти, които пристигат за преглед за текущия ден. Цяло число в интервала [0…10 000]
# Изход
# Да се отпечатат на конзолата 2 реда :
# •	На първия ред: "Treated patients: {брой прегледани пациенти}."
# •	На втория ред: "Untreated patients: {брой непрегледани пациенти}."

period = int(input())
doctors = 7

all_patients = 0
served_patients = 0
notserved_patients = 0

for day in range(1,period+1):

    if (day % 3 == 0) and (notserved_patients > served_patients):
        doctors += 1

    arriving = int(input())
    if arriving >= doctors:
        reviewed = doctors
    else: reviewed = arriving

    all_patients += arriving
    served_patients += reviewed
    notserved_patients = all_patients - served_patients

    day += 1

print(f'Treated patients: {served_patients}.')
print(f'Untreated patients: {(all_patients - served_patients)}.')

