# Цената на тон, за която се превозва товара е различна за всяко превозно средство:
# •	До 3 тона – микробус (200 лева на тон)
# •	От 4 до 11 тона – камион (175 лева на тон)
# •	12 и повече тона – влак (120 лева на тон)
# Вашата задача е да изчислите средната цена на тон превозен товар, както и процента на тоновете  превозвани с всяко превозно средство, спрямо общото тегло(в тонове) на всички товари.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на товарите за превоз – цяло число в интервала [1...1000]
# •	За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала [1...1000]
# Изход
# Да се отпечатат на конзолата 4 реда, както следва:
# •	Първи ред – средната цена на тон превозен товар (закръглена до втория знак след дес. запетая);
# •	Втори ред – процентът тона превозвани с микробус (процент между 0.00% и 100.00%);
# •	Трети ред – процентът  тона превозвани с камион (процент между 0.00% и 100.00%);
# •	Четвърти ред – процентът тона превозвани с влак (процент между 0.00% и 100.00%).

count_cargo = int(input())

bus_ton = 0
truck_ton = 0
train_ton = 0
cost = 0

for cargo in range(1,count_cargo + 1):
    cargo_weight = int(input())

    if cargo_weight <= 3:
        bus_ton += cargo_weight
        cost += 200 * cargo_weight

    elif cargo_weight <= 11:
        truck_ton += cargo_weight
        cost += 175 * cargo_weight

    elif cargo_weight >= 12:
        train_ton += cargo_weight
        cost += 120 * cargo_weight

    cargo += 1

print(f'{(cost / (bus_ton + truck_ton +train_ton) ):.2f}')
print(f'{(bus_ton / (bus_ton + truck_ton +train_ton) * 100):.2f}%')
print(f'{(truck_ton / (bus_ton + truck_ton +train_ton) * 100):.2f}%')
print(f'{(train_ton / (bus_ton + truck_ton +train_ton) * 100):.2f}%')
