# Напишете програма, която изчислява средната оценка на ученик от цялото му обучение.
# На първия ред ще получите името на ученика, а на всеки следващ ред неговите годишни оценки.
# Ученикът преминава в следващия клас, ако годишната му оценка е по-голяма или равна на 4.00.
# Ако ученикът бъде скъсан повече от един път, то той бива изключен и програмата приключва, като се отпечатва името на ученика и в кой клас бива изключен.
#  При успешно завършване на 12-ти клас да се отпечата :
# "{име на ученика} graduated. Average grade: {средната оценка от цялото обучение}"
# В случай, че ученикът е изключен от училище, да се отпечата:
# "{име на ученика} has been excluded at {класа, в който е бил изключен} grade"
# Стойността трябва да бъде форматирана до втория знак след десетичната запетая.

st_name = input()
clas = 1
avv_mark = 0
fail = 0

for curr_clas in range(1, 13):
    year_mark = float(input())

    if year_mark < 4:
        avv_mark += year_mark
        fail += 1

        if fail > 1:
            print(f'{st_name} has been excluded at {clas} grade')
            break
        else:
            continue

    else:
        clas += 1
        avv_mark += year_mark

if curr_clas >= 12:
    avv_mark /= 12
    print(f'{st_name} graduated. Average grade: {avv_mark:.2f}')



