# Първоначално прочитаме от конзолата капацитета на стадиона и броят на всички фенове. След това за всеки фен се чете секторът, в който се намира.
# Феновете на първия отбор са в сектор А и Б, а на втория – В и Г.
# От конзолата се четат поредица от числа, всяко на отделен ред:
# 1.	Капацитетът на стадиона – цяло число в интервала [1 … 10000];
# 2.	Броят на всички фенове – цяло число в интервала [1 … 10000].
# За всеки един фен, на отделен ред се прочита:
# 1.	Секторът, на който се намира – текст – "A", "B", "V" и "G".
# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между 0.00% и 100.00%, форматирани до втората цифра след десетичната запетая:
# 1.	Процентът на феновете в сектор А
# 2.	Процентът на феновете в сектор Б
# 3.	Процентът на феновете в сектор В
# 4.	Процентът на феновете в сектор Г
# 5.	Процентът на всички фенове, спрямо капацитета на стадиона.

stadium = int(input())
all_fens = int(input())

a_fens = 0
b_fens = 0
v_fens = 0
g_fens = 0

for curr_fen in range(1, all_fens + 1):
    curr_fen = input()
    if curr_fen == 'A':
        a_fens += 1
    elif curr_fen == 'B':
        b_fens += 1
    elif curr_fen == 'V':
        v_fens += 1
    elif curr_fen == 'G':
        g_fens += 1

print(f'{(a_fens / all_fens * 100):.2f}%')
print(f'{(b_fens / all_fens * 100):.2f}%')
print(f'{(v_fens / all_fens * 100):.2f}%')
print(f'{(g_fens / all_fens * 100):.2f}%')
print(f'{(all_fens / stadium * 100):.2f}%')
